# Представленные задания для подготовки к экзамену ⏰
## Типа 2:№28677, №15124, №26974, №33174, №83132, №15618, №35460, №27287, №15970, №16377, №16431
## Типа 8:№3697, №78064, №3570, №72566, №55625, №81474, №59744, №7667, №8098, №3206, №17328, №18079, №18491,

## Решения задач:
## Тип 2 №28677
''Логическая функция F задаётся выражением ((x → y) ∨ (y ≡ w)) ∧ ((x ∨ z) ≡ w). 
На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. 
Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.''
```
print ('x y z w')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((x <= y) or (y == w)) and ((x or z) == w):
                    print(x, y, z, w)
```
``Пояснение: первой строкой является из таблицы является 0 0 1 1, исходя из этого второй столбец 0 1 0 0, т.к молжно предположить что там только одна 1, значит третья строка это **x**, первая **z**, вторая **y** и исключащий **w**``
### Ответ: zyxw
## Тип 8 №3697
Все 5-⁠буквенные слова, составленные из букв В, И, Н, Т, записаны в алфавитном порядке и пронумерованы. Вот начало списка:

1.  ВВВВВ
2.  ВВВВИ
3.  ВВВВН
4.  ВВВВТ
5.  ВВВИВ
...

Запишите слово, которое стоит под номером 1019.
```
word = 'ВИНТ'
x = 0
for x1 in range (0, len(word)):
    for x2 in range (0, len(word)):
        for x3 in range (0, len(word)):
            for x4 in range (0, len(word)):
                for x5 in range (0, len(word)):
                    x += 1
                    if x == 1019:
                        print(word[x1], word[x2], word[x3], word[x4], word[x5])
```
### Ответ: ТТТНН

## Тип 2 №15124
Логическая функция F задаётся выражением (x ≡ y ) ∨ ((y ∨ z) → x).
Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z.
```
print('x y z')
for x in range(2):
    for y in range(2):
        for z in range(2):
            if (x == y) or ((y or z) <= x) == False:
                print(x,y,z)
```
### Ответ: xzy

## Тип 8 №78064
Все 5⁠-⁠буквенные слова, в составе которых могут быть только буквы К, Р, О, В, А, Т, Ь, записаны в алфавитном порядке и пронумерованы.
Вот начало списка:
1.  ААААА
2.  ААААВ
3.  ААААК
4.  ААААО
5.  ААААР
6.  ААААТ
...
Под каким номером в списке идёт последнее слово c нечётным номером, которое содержит не более одной буквы Т, две буквы В и не содержит букв Ь, стоящих рядом?
```
a = 'АВКОРТЬ'
c = 0
for x in a:
    for y in a:
        for z in a:
            for w in a:
                for h in a:
                    s = x + y + z + w + h
                    c += 1
                    if c % 2 != 0 and ("ЬЬ" not in s) and s.count("В") == 2 and s.count("Т") <= 1:
                        print(c, s)
```
`` ``
### Ответ: 16277

## Тип 2 №26974
Логическая функция F задаётся выражением (x ∨ y) ∧ ¬(y ≡ z) ∧ ¬w. На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.
```
print("x y z w")
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if (x or y) and not(y == z) and not w:
                    print(x, y, z, w)
```
### Ответ: xzyw

## Тип 8 №55625
Ярослав составляет коды из букв, входящих в слово ЯРОСЛАВ. Код должен состоять из 5 букв, буквы в коде не должны повторяться, согласных в коде должно быть больше, чем гласных, две гласные буквы нельзя ставить рядом. Сколько кодов может составить Ярослав?
```

```
### Ответ:

## Тип 2 №15618
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z) ∨ ¬w. На рисунке приведён фрагмент таблицы истинности функции F, содержащий все наборы аргументов, при которых функция F ложна. Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных w, x, y, z. Все строки в представленном фрагменте разные.
```
print ('x y z w')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if (x and not y) or (y == z) or not w:
                    print(x, y, z, w)
```
``Пояснение: Первый столбец это w потому что она должна равняться 1, второй z т.к если F должен быть ложен, третий y по исключению и x``
### Ответ: wzyx

## Тип 8 №7667
Сколько слов длины 5, начинающихся с гласной буквы, можно составить из букв Е, Г, Э? Каждая буква может входить в слово несколько раз. Слова не обязательно должны быть осмысленными словами русского языка.
```

```
### Ответ:
