# Представленные задания для подготовки к экзамену ⏰
## Типа 2:№28677, №15124, №18071, №15939, №26974, №33174, №83132, №15618, №35460, №27287, №15970, №16377, №16431
## Типа 8:№3697, №78064, №3570, №72566, №55625, №81474, №59744, №7667, №8098, №3206, №17328, №18079, №18491,

## Решения задач:
## Тип 2 №28677
''Логическая функция F задаётся выражением ((x → y) ∨ (y ≡ w)) ∧ ((x ∨ z) ≡ w). 
На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. 
Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.''
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((x <= y) or (y == w)) and ((x or z) == w):
                    print(x, y, z, w)
```
### Ответ: zyxw

## Тип 8 №3697
Все 5-⁠буквенные слова, составленные из букв В, И, Н, Т, записаны в алфавитном порядке и пронумерованы. Вот начало списка:

1.  ВВВВВ
2.  ВВВВИ
3.  ВВВВН
4.  ВВВВТ
5.  ВВВИВ
...

Запишите слово, которое стоит под номером 1019.
```
word = 'ВИНТ'
x = 0
for x1 in range (0, len(word)):
    for x2 in range (0, len(word)):
        for x3 in range (0, len(word)):
            for x4 in range (0, len(word)):
                for x5 in range (0, len(word)):
                    x += 1
                    if x == 1019:
                        print(word[x1], word[x2], word[x3], word[x4], word[x5])
```
### Ответ: ТТТНН

## Тип 2 №28677
Логическая функция F задаётся выражением (x ≡ y ) ∨ ((y ∨ z) → x).
Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z.
```

```
### Ответ: xzy

## Тип 8 №78064
