# Представленные задания для подготовки к экзамену ⏰
## Типа 2:№28677, №15124, №18071, №15939, №26974, №33174, №83132, №15618, №35460, №27287, №15970, №16377, №16431
## Типа 8:№3697, №78064, №3570, №72566, №55625, №81474, №59744, №7667, №8098, №3206, №17328, №18079, №18491,

### Решения задач:
### №28677
''Логическая функция F задаётся выражением ((x → y) ∨ (y ≡ w)) ∧ ((x ∨ z) ≡ w). 
На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. 
Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.''
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((x <= y) or (y == w)) and ((x or z) == w):
                    print(x, y, z, w)
```
