# Задание с перебором for
## Задание №1
Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [10000;
20001], числа, имеющие ровно 5 различных делителей. Выведите эти делители для каждого найденного
числа в порядке возрастания.
```
for x in range(10000, 20002):
    c = set()
    for i in range(1, x+1):
        if x % i == 0:
            c.add(i)
    if len(c) == 5:
        print(*sorted(c))
```
## Задание №2
Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [10000;
12345], простые числа. Выведите сумму этих чисел.
```
a = 0
for n in range(10000, 12345):
    c = True
    if n < 2:
        c = False
    else:
        for i in range(2, n):
            if n % i == 0:
                c = False
                break
    if c:
        a += n
print(a)
```
## Задание №3
Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число
m». Для какого наибольшего натурального числа А формула
(¬ДЕЛ(x, A) ∧ ДЕЛ(x, 4)) → ¬ДЕЛ(x, 9)
тождественно истинна (т.е. принимает значение 1 при любом натуральном значении переменной x)?
Напишите программу для решения данной задачи.
```
for a in range(1, 1000):
    c = 0
    for x in range(1, 1001):
        if ((x % a != 0) and (x % 4 == 0)) and (x % 9 == 0):
            a = False
            c += 1
            break
print(c)
```
## Задание №4
Для какого наименьшего числа А формула
(x > 15) ∨ (x < 2y) ∨ (A > x+y)
тождественно истинна для любых целых положительных значений x и y. Напишите программу для
решения данной задачи.
```
for a in range(1, 100):
    c = 0
    for x in range(1, 101):
        for y in range(1, 101):
            if not (x > 15) and not (x < 2 * y) and not (a > x + y):
                a = False
                c += 1
                break
        if c ==1:
            break
    if c == 0:
        print(a)
        break
```
