# 1 пример
На вход алгоритм натуральное число N. Алгоритм по нему новое число R следующим образом.
1) Строится двоичная запись числа N.
2) Затем справа дописывается два разряда: символ 01, если число чётное, и 10 если нечетное.
Получаем таким образом запись (в ней два разряда больше чем в записи числа N)
является двоичной записью искомого числа R. Укажите минимальное число R, больше 130, которое может
являться результатом работы этого алгоритма. В ответ это число запишите в десятичной системе.
```
n = int(input())    #Ввести через панель значение.
r = bin(n)          #Перевод введёного значения в число с основанием 2.
print(r)            #Вывести полученное значение.
```

```
n = int(input())    #Ввести через панель значение.
r = bin(n)[2:]      #Перевод введёного значения в число с основанием 2 убирая первые два символа.
print(r)            #Вывести полученное значение.
```

```
n = int(input())    #Ввести через панель значение.
r = bin(n)[2:]      #Перевод введёного значения в число с основанием 2 убирая первые два символа.
if n % 2 == 0:      #Если значение n делится на 2 без остатка то,
    r += '01'       #оно чётное и приписываем справа 01
else:               #или
    r += '10'       #оно нечётное и припысываем 10.
print(r)            #Выводим полученное значение.
```

```
for n in range(1, 100):         #Производим перебор чисел от 1 до 99.
    r = bin(n)[2:]              #Перевод значени n в число с основанием 2 убирая первые два символа.
    if n % 2 == 0:              #Если значение n делится на 2 без остатка то,
        r += '01'               #оно чётное и приписываем справа 01
    else:                       #или
        r += '10'               #оно не нечётное и припысываем 10.
    print(n, r)                 #Выводим полученное значение.
```

```
for n in range(1, 100):         #Производим перебор чисел от 1 до 99.
    r = bin(n)[2:]              #Перевод значени n в число с основанием 2 убирая первые два символа.
    if n % 2 == 0:              #Если значение n делится на 2 без остатка то,
        r += '01'               #оно чётное и приписываем справа 01
    else:                       #или
        r += '10'               #оно не нечётное и припысываем 10.
    print(n, int(r, 2))         #Выводим значение n и полученное двоичное число переводим десятичную
```

```
for n in range(1, 100):         #Производим перебор чисел от 1 до 99.
    r = bin(n)[2:]              #Перевод значени n в число с основанием 2 убирая первые два символа.
    if n % 2 == 0:              #Если значение n делится на 2 без остатка то,
        r += '01'               #оно чётное и приписываем справа 01
    else:                       #или
        r += '10'               #оно не нечётное и припысываем 10.
    if int(r, 2) > 130:         #Если полученное значение больше 130 то,
        print(int(r, 2))        #Выводим его и переводим десятичную.
```
## 2 пример
На вход алгоритма подается натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1) Строится двоичная запись числа N
2) К этой записи дописывается справа бит четности: 0, если в двоичном коде числа N было четное число единиц, и 1 если нечетное.
3) К полученному результату дописывается еще один бит четности.
Полученная таким образом запись(в ней на два разряда больше, чем в записи исходного числа N) является двоичной записью искомого числа R.
Укажите минимальное ичсло N, после обработки которого с помощью этого алгоритма получаетсячисло, больше, чем 184. В ответе это число запишите в десятичной системе.
```
n = int(input())    #Ввести через панель значение.
r = bin(n)          #Перевод введёного значения в число с основанием 2.
```

```
n = int(input())             #Ввести через панель значение.
r = bin(n)[2:]               #Перевод введёного значения в число с основанием 2.
print(r)                     #Выводим значение r
if r.count('1') % 2 == 0:    #Считаем кол-во единиц и их суммарную чётность.
    r += '0'                 #Если чётно, то добавляем 0 справа
else:                        #или
    r += '1'                 #1 если не чётно.
print(r)                     #Выводим значение r
if r.count('1') % 2 == 0:    #Считаем кол-во единиц и их суммарную чётность.
    r += '0'                 #Если чётно, то добавляем 0 справа
else:                        #или
    r += '1'                 #1 если не чётно.
print(r)                     #Выводим значение r
```

```
for n in range(1, 100):          #Производим перебор чисел от 1 до 99.
    r = bin(n)[2:]               #Перевод введёного значения в число с основанием 2.
    print(r)                     #Выводим значение r
    if r.count('1') % 2 == 0:    #Считаем кол-во единиц и их суммарную чётность.
        r += '0'                 #Если чётно, то добавляем 0 справа
    else:                        #или
        r += '1'                 #1 если не чётно.
    print(r)                     #Выводим значение r
    if r.count('1') % 2 == 0:    #Считаем кол-во единиц и их суммарную чётность.
        r += '0'                 #Если чётно, то добавляем 0 справа
    else:                        #или
        r += '1'                 #1 если не чётно.
    print(r)                     #Выводим значение r
```

```
for n in range(1, 100):          #Производим перебор чисел от 1 до 99.
    r = bin(n)[2:]               #Перевод введёного значения в число с основанием 2.
    print(r)                     #Выводим значение r
    if r.count('1') % 2 == 0:    #Считаем кол-во единиц и их суммарную чётность.
        r += '0'                 #Если чётно, то добавляем 0 справа
    else:                        #или
        r += '1'                 #1 если не чётно.
    print(r)                     #Выводим значение r
    if r.count('1') % 2 == 0:    #Считаем кол-во единиц и их суммарную чётность.
        r += '0'                 #Если чётно, то добавляем 0 справа
    else:                        #или
        r += '1'                 #1 если не чётно.
    if int(r, 2) > 184:          #Переводим значение r в десятичную и выбираем числа, которые больше 184. 
    print(n)                     #Выводим значение n.
```
